In [2]:
import numpy as np
import pandas as pd

# DATA INPUT AND OUTPUT 
 * CSV
 * EXEL
 * HTML
 * SQL

In [3]:
pwd

'/home/ahmed/Downloads/Apprentissage/Pandas'

In [5]:
pd.read_csv("example")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [6]:
df = pd.read_csv("example")

In [7]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [14]:
df.to_csv("My_output",index=False)
pd.read_csv("My_output")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [33]:
pd.read_excel("Excel_Sample.xlsx",sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [34]:
df.to_excel("Excel_Sample2.xlsx",sheet_name="newSheet")

In [37]:
pd.read_excel("Excel_Sample2.xlsx",sheet_name="newSheet")

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [38]:
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [40]:
type(data)

list

In [43]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"
4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017"

In [46]:
from sqlalchemy import create_engine

In [48]:
engine = create_engine("sqlite:///:memory:")

In [57]:
df.to_sql("my_tabletest",engine)

ValueError: Table 'my_tabletest' already exists.

In [62]:
sqldf = pd.read_sql("my_tabletest",con=engine)
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15